In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\amrut\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: ipython in c:\users\amrut\anaconda3\lib\site-packages (from ipython-sql) (8.2.0)
Requirement already satisfied: six in c:\users\amrut\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\amrut\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in c:\users\amrut\anaconda3\lib\site-packages (from ipython-sql) (3.6.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\amrut\anaconda3\lib\site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: sqlparse in c:\users\amrut\anaconda3\lib\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\amrut\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (1.1.1)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\amrut\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: pickleshare in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: pygments>=2.4.0 in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: matplotlib-inline in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.2)
Requirement already satisfied: jedi>=0.16 in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: setuptools>=18.5 in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (61.2.0)
Requirement already satisfied: colorama in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.4)
Requirement already satisfied: decorator in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: stack-data in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: backcall in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\amrut\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\amrut\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->ipython-sql) (0.2.5)
Requirement already satisfied: asttokens in c:\users\amrut\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: executing in c:\users\amrut\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: pure-eval in c:\users\amrut\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [2]:
%load_ext sql

In [3]:
%sql postgresql://postgres:Omsairam123%40@localhost:5432/HumanResources

# Lets explore all the tables

In [4]:
%%sql
SELECT * FROM departments

 * postgresql://postgres:***@localhost:5432/HumanResources
3 rows affected.

[(1, 'HR', 1), (2, 'IT', 2), (3, 'Sales', 3)]

In [5]:
%%sql
SELECT * FROM employees

 * postgresql://postgres:***@localhost:5432/HumanResources
6 rows affected.

[(1, 'John Doe', datetime.date(2018, 6, 20), 'HR Manager', 1),
 (2, 'Jane Smith', datetime.date(2019, 7, 15), 'IT Manager', 2),
 (3, 'Alice Johnson', datetime.date(2020, 1, 10), 'Sales Manager', 3),
 (4, 'Bob Miller', datetime.date(2021, 4, 30), 'HR Associate', 1),
 (5, 'Charlie Brown', datetime.date(2022, 10, 1), 'IT Associate', 2),
 (6, 'Dave Davis', datetime.date(2023, 3, 15), 'Sales Associate', 3)]

In [6]:
%%sql
SELECT * FROM projects

 * postgresql://postgres:***@localhost:5432/HumanResources
3 rows affected.

[(1, 'HR Project 1', datetime.date(2023, 1, 1), datetime.date(2023, 6, 30), 1),
 (2, 'IT Project 1', datetime.date(2023, 2, 1), datetime.date(2023, 7, 31), 2),
 (3, 'Sales Project 1', datetime.date(2023, 3, 1), datetime.date(2023, 8, 31), 3)]

## Find the longest ongoing project for each department.

In [14]:
%%sql

SELECT d.name
FROM departments d INNER JOIN projects p ON
d.id=p.department_id

 * postgresql://postgres:***@localhost:5432/HumanResources
3 rows affected.

[(1, 'HR', 'HR Project 1', 180),
 (2, 'IT', 'IT Project 1', 180),
 (3, 'Sales', 'Sales Project 1', 183)]

### Find all employees who are not managers.

In [19]:
%%sql
#method 1

SELECT id,name
FROM employees
WHERE job_title not like '%Manager%'

#method 2 : using subquery to fetch manager id from departments table and using then selecting ids from the employees table whose id is not in the result set from the subquery
SELECT id,name
FROM employees WHERE id NOT IN (SELECT distinct manager_id
FROM departments)

 * postgresql://postgres:***@localhost:5432/HumanResources
3 rows affected.

[(4, 'Bob Miller'), (5, 'Charlie Brown'), (6, 'Dave Davis')]

## Find all employees who have been hired after the start of a project in their department.

In [29]:
%%sql

SELECT e.id,e.name,e.hire_date
FROM employees e INNER JOIN projects p on
e.department_id=p.department_id AND e.hire_date>p.start_date

 * postgresql://postgres:***@localhost:5432/HumanResources
1 rows affected.

[(6, 'Dave Davis', datetime.date(2023, 3, 15))]

## Rank employees within each department based on their hire date (earliest hire gets the highest rank).

In [40]:
%%sql
SELECT department_id,
       id,
       name,
       hire_date,
       dense_rank() over(partition by department_id order by hire_date) rank
FROM employees

 * postgresql://postgres:***@localhost:5432/HumanResources
6 rows affected.

[(1, 1, 'John Doe', datetime.date(2018, 6, 20), 1),
 (1, 4, 'Bob Miller', datetime.date(2021, 4, 30), 2),
 (2, 2, 'Jane Smith', datetime.date(2019, 7, 15), 1),
 (2, 5, 'Charlie Brown', datetime.date(2022, 10, 1), 2),
 (3, 3, 'Alice Johnson', datetime.date(2020, 1, 10), 1),
 (3, 6, 'Dave Davis', datetime.date(2023, 3, 15), 2)]

### Find the duration between the hire date of each employee and the hire date of the next employee hired in the same department.

In [66]:
%%sql
WITH rank as (SELECT d.name department,e.name employee,e.hire_date,RANK() OVER(PARTITION BY d.name order by e.hire_date) rank
FROM employees e INNER JOIN departments d ON 
e.department_id=d.id),
lead as (SELECT department,
         employee,
         hire_date,
         rank,
         lead(rank,1) over(partition by department order by rank) next_rank
        FROM rank)
SELECT t1.department,
t1.employee,
t2.employee next_hired,
t1.hire_date-t2.hire_date duration
FROM lead t1 INNER JOIN lead t2 ON 
t1.department=t2.department AND t1.rank=t2.next_rank


#Approach was to first rank the employees acc to their hire date within the same department
#using this as cte, calculated the lead rank of the previously hired employee.
#once this was done, using the previous table, joined it on itself with matching department ids and rank of first hired.
#with rank of next hired( reason why lead was calculated)
#finally, pulled the necessary data along with calculating the duration.

 * postgresql://postgres:***@localhost:5432/HumanResources
3 rows affected.

[('HR', 'Bob Miller', 'John Doe', 1045),
 ('IT', 'Charlie Brown', 'Jane Smith', 1174),
 ('Sales', 'Dave Davis', 'Alice Johnson', 1160)]